/*
  String_ui.strings
  iina

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
// Common

"general.on" = "Päällä";
"general.off" = "Pois päältä";
"general.login" = "Kirjaudu sisään";
"general.logout" = "Kirjaudu ulos";
"general.ok" = "OK";
"general.cancel" = "Peruuta";
"general.username" = "Käyttäjätunnus";
"general.password" = "Salasana";
"general.na" = "N/A";

"input.value_is_empty" = "Value cannot be empty.";
"input.already_exists" = "Value already exists.";

// Guide Window
"guide.highlights" = "Kohokohdat";
"guide.basic_settings" = "Perusasetukset";
"guide.faq" = "Usein kysytyt kysymykset";

// Initial Window
"initial.announcement" = "You are using a %@ version of IINA";
"initial.beta.desc" = "If you want to rollback to a release version, uncheck \"receive beta updates\" from Settings > General, and install a stable release from our <a href=\"https://iina.io\">official website</a>.";
"initial.nightly.desc" = "Nightly is not recommended to be used as your daily driver. Currently nightly builds do not support auto update. Please manually download newer builds from our <a href=\"https://nightly.iina.io\">nightly website</a>.";
"initial.debug.desc" = "Debug builds are usually not optimized for performance, so it is not recommended to be used as daily drive. Debug builds do not support auto update.";
"initial.bug_report" = "Report via <a href=\"https://github.com/iina/iina/issues\">GitHub issues</a>.";

// Inspector Window
"inspector.error" = "Virhe";

// MainWindowController.swift
"main.buffering_indicator" = "Puskuroidaan… %d%%";
"main.opening_stream" = "Avataan streamia…";
"main.seeking_indicator" = "Seeking…";
"osc.precision" = "Tarkkuus";
"osc.1s" = "1 sekunti";
"osc.100ms" = "100 millisekuntia";
"osc.10ms" = "10 millisekuntia";
"osc.1ms" = "1 millisekunti";

// QuickSettingViewController.swift
"quicksetting.item_default" = "Oletus";
"quicksetting.item_none" = "Ei mitään";
"quicksetting.hwdec" = "Laitteistopohjainen purku";
"quicksetting.deinterlace" = "Lomituksenpoisto";
"quicksetting.hdr" = "HDR";
"quicksetting.hide" = "Piilota";
"quicksetting.reset_speed" = "Reset speed to 1x";

// EQ Presets
"eq.preset.flat" = "Flat";
"eq.preset.acoustic" = "Acoustic";
"eq.preset.classical" = "Classical";
"eq.preset.dance" = "Dance";
"eq.preset.deep" = "Deep";
"eq.preset.electronic" = "Electronic";
"eq.preset.hip_hop" = "Hip Hop";
"eq.preset.increase_bass" = "Increase Bass";
"eq.preset.increase_treble" = "Increase Treble";
"eq.preset.increase_vocal" = "Increase Vocal";
"eq.preset.jazz" = "Jazz";
"eq.preset.latin" = "Latin";
"eq.preset.loundness" = "Loundness";
"eq.preset.lounge" = "Lounge";
"eq.preset.piano" = "Piano";
"eq.preset.pop" = "Pop";
"eq.preset.rnb" = "R&B";
"eq.preset.reduce_bass" = "Reduce Bass";
"eq.preset.reduce_treble" = "Reduce Treble";
"eq.preset.rock" = "Rock";
"eq.preset.small_speaker" = "Small Speaker";
"eq.preset.spoken_word" = "Spoken Word";

"alert.eq.new_profile.title" = "New EQ Profile";
"alert.eq.new_profile.message" = "Please enter a profile name.";
"alert.eq.rename.title" = "Rename Current Profile";
"alert.eq.rename.message" = "Please enter a new profile name.";

// OSDMessage.swift
"osd.pause" = "Tauko";
"osd.resume" = "Jatka";
"osd.volume" = "Äänenvoimakkuus: %@";
"osd.speed" = "Speed: %@x";
"osd.aspect" = "Kuvasuhde: %@";
"osd.crop" = "Rajaus: %@";
"osd.rotate" = "Kierto: %i°";
"osd.deinterlace" = "Lomituksenpoisto: %@";
"osd.hwdec" = "Laitteistopohjainen purku: %@";
"osd.audio_delay.nodelay" = "Äänen viive: Ei viivästystä";
"osd.audio_delay.later" = "Äänen viive: %@s myöhemmin";
"osd.audio_delay.earlier" = "Äänen viive: %@s aiemmin";
"osd.sub_delay.nodelay" = "Äänen viive: Ei viivästystä";
"osd.sub_delay.later" = "Tekstityksen viive: %@s myöhemmin";
"osd.sub_delay.earlier" = "Tekstityksen viive: %@s aiemmin";
"osd.subtitle_pos" = "Tekstityksen sijainti: %@";
"osd.sub_hidden" = "Subtitles Hidden";
"osd.sub_visible" = "Subtitles Visible";
"osd.sub_second_delay.nodelay" = "Secondary Subtitle Delay: No Delay";
"osd.sub_second_delay.later" = "Secondary Subtitle Delay: %@s Later";
"osd.sub_second_delay.earlier" = "Secondary Subtitle Delay: %@s Earlier";
"osd.sub_second_hidden" = "Secondary Subtitles Hidden";
"osd.sub_second_pos" = "Secondary Subtitle Position: %@";
"osd.sub_second_visible" = "Secondary Subtitles Visible";
"osd.mute" = "Mykistä";
"osd.unmute" = "Poista mykistys";
"osd.screenshot" = "Kuvankaappaus otettu";
"osd.abloop.a" = "AB-silmukka: A";
"osd.abloop.b" = "AB-silmukka: B";
"osd.abloop.clear" = "AB-silmukka: Tyhjennetty";
"osd.stop" = "Pysäytä";
"osd.chapter" = "Kappale: %@";
"osd.subtitle_scale" = "Tekstityksen skaalaus: %@x";
"osd.add_to_playlist" = "Lisätty %i tiedostoa soittolistaan";
"osd.clear_playlist" = "Soittolista tyhjennetty";
"osd.video_eq.contrast" = "Kontrasti: %i";
"osd.video_eq.gamma" = "Gamma: %i";
"osd.video_eq.hue" = "Värisävy: %i";
"osd.video_eq.saturation" = "Kylläisyys: %i";
"osd.video_eq.brightness" = "Kirkkaus: %i";
"osd.find_online_sub" = "Etsitään tekstityksiä verkosta…";
"osd.find_online_sub.source" = "lähde:";
"osd.sub_not_found" = "Tekstityksiä ei löytynyt";
"osd.sub_found" = "%d subtitles found.";
"osd.sub_downloading" = "Downloading %d subtitles";
"osd.sub_downloaded" = "Tekstitys ladattu";
"osd.sub_saved" = "Tekstitys tallennettu";
"osd.network_error" = "Verkkovirhe";
"osd.file_error" = "Virhe luettaessa tiedostoa";
"osd.cannot_login" = "Kirjautuminen ei onnistu";
"osd.canceled" = "Peruutettu";
"osd.cannot_connect" = "Cannot connect";
"osd.timed_out" = "Timed Out";
"osd.filter_added" = "Lisätty suodatin %@";
"osd.filter_removed" = "Poistettu suodatin";
"osd.file_loop" = "Loop Single File";
"osd.playlist_loop" = "Loop Playlist";
"osd.no_loop" = "Disable Looping";

"preference.title" = "Asetukset";
"preference.general" = "Yleiset";
"preference.ui" = "Käyttöliittymä";
"preference.video_audio" = "Video / ääni";
"preference.subtitle" = "Tekstitys";
"preference.network" = "Verkko";
"preference.control" = "Ohjaus";
"preference.keybindings" = "Oikotiet";
"preference.advanced" = "Lisäasetukset";
"preference.plugins" = "Plugins";
"preference.utilities" = "Apuohjelmat";
"preference.scripts" = "Komentosarjat";
"preference.not_logged_in" = "Ei kirjautuneena";
"preference.logged_in_as" = "Kirjauduttu nimellä %@";
"preference.system_media_control" = "Käytä järjestelmän mediaohjausta";

"preference.key_binding_hint_1" = "Jos haluat muokata oikoteitä nykyisessä määritystiedostossa, napsauta ensin \"Monista…\"-painiketta luodaksesi kopion.";
"preference.key_binding_hint_2" = "Kaksoisnapsauta oikean reunan riviä muokataksesi vastaavaa oikotietä.";

"preference.enable_adv_settings" = "Salli lisäasetukset";

"preference.sub_override_level.no" = "no";
"preference.sub_override_level.force" = "force";
"preference.sub_override_level.scale" = "scale";
"preference.sub_override_level.strip" = "poista";
"preference.sub_override_level.yes" = "yes";

"preference.sub_override_level.descriptive_text.no" = "Render subtitles as specified by the subtitle scripts, without overrides.";
"preference.sub_override_level.descriptive_text.force" = "Apply all subtitle styles.";
"preference.sub_override_level.descriptive_text.scale" = "Apply the scale setting in addition to the style settings in this section.";
"preference.sub_override_level.descriptive_text.strip" = "Radically strip all ASS tags and styles from the subtitle.";
"preference.sub_override_level.descriptive_text.yes" = "Apply all the style settings in this section.";

"preference.ytdl_plugin_not_installed" = "Install the Online Media plugin from \"Plugins > Install from GitHub\" to enjoy advanced features such and video downloading and auto yt-dlp updates.";
"preference.ytdl_plugin_installed" = "The built-in youtube-dl support is disabled since you have the Online media plugin installed.";

"menu.volume" = "Äänenvoimakkuus: %@";
"menu.volume_muted" = "Volume: %@ (Muted)";
"menu.audio_delay" = "Äänen viive: %@s";
"menu.sub_delay" = "Tekstityksen viive: %@s";
"menu.sub_hide" = "Hide Subtitles";
"menu.sub_show" = "Show Subtitles";
"menu.sub_second_hide" = "Hide Secondary Subtitles";
"menu.sub_second_show" = "Show Secondary Subtitles";
"menu.fullscreen" = "Siirry koko näytön tilaan";
"menu.exit_fullscreen" = "Poistu koko näytön tilasta";
"menu.pip" = "Siirry kuva kuvassa -tilaan";
"menu.exit_pip" = "Poistu kuva kuvassa -tilasta";
"menu.mini_player" = "Enter Music Mode";
"menu.exit_mini_player" = "Exit Music Mode";
"menu.pause" = "Tauko";
"menu.resume" = "Jatka";
"menu.speed" = "Speed: %@x";
"menu.chapters" = "Näytä lukupaneeli";
"menu.hide_chapters" = "Hide Chapters Panel";
"menu.playlist" = "Näytä soittolistan paneeli";
"menu.hide_playlist" = "Hide Playlist Panel";
"menu.video" = "Näytä Videopaneeli";
"menu.hide_video" = "Hide Video Panel";
"menu.audio" = "Näytä Äänipaneeli";
"menu.hide_audio" = "Hide Audio Panel";
"menu.subtitles" = "Näytä Tekstityspaneeli";
"menu.hide_subtitles" = "Hide Subtitles Panel";

"menu.seek_forward" = "Astu eteenpäin %@s";
"menu.seek_backward" = "Siirry taaksepäin %@s";
"menu.speed_up" = "Speed Up by %@x";
"menu.speed_down" = "Speed Down by %@x";
"menu.volume_up" = "Äänenvoimakkuus + %@%%";
"menu.volume_down" = "Äänenvoimakkuus - %@%%";
"menu.audio_delay_up" = "Äänen viive + %@s";
"menu.audio_delay_down" = "Äänen viive - %@s";
"menu.sub_delay_up" = "Tekstityksen viive + %@s";
"menu.sub_delay_down" = "Tekstityksen viive - %@s";

"menu.crop_custom" = "Mukautettu…";
"menu.find_online_sub" = "Find Online Subtitles from %@";

"menu.manage_plugins" = "Manage Plugins…";
"menu.developer_tool" = "Developer Tool";
"menu.more_plugin" = "More…";
"menu.conflicting_shortcuts" = "Conflicting key shortcuts…";
"menu.reload_plugins" = "Reload All Plugins";
"menu.show_plugins_panel" = "Show Plugins Panel";
"menu.hide_plugins_panel" = "Hide Plugins Panel";

"track.audio" = "Ääni";
"track.none" = "<Ei mitään>";
"track.sub" = "Tekstitys";
"track.video" = "Video";

"subtrack.no_loaded" = "Teksityksiä ei ladattu";
"subtrack.no_external" = "Ulkoisia tekstityksiä ei löytynyt";

// Alerts
"alert.beta_channel.title" = "Vastaanota päivityksiä beta-versioihin";

"alert.title_error" = "Virhe";
"alert.title_warning" = "Varoitus";
"alert.title_info" = "Tietoja";

"alert.fatal_error" = "Vakava virhe: %@ \nSovellus lopetetaan nyt.";
"alert.mpv_error" = "Sisäinen virhe %@ (%@) asetettaessa valintaa %@.";

"alert.unsupported_audio" = "Ulkoista äänitiedostoa ei tuettu.";
"alert.unsupported_video" = "Unsupported external video file.";
"alert.unsupported_sub" = "Ulkoista tekstitystä ei tuettu.";
"alert.unsupported_url" = "URL-osoitetta ei tuettu.";
"alert.wrong_url_format" = "Virheellinen URL-osoitteen muoto.";

"alert.error_open" = "Tiedostoa tai suoratoistoa ei voida avata!";
"alert.error_finding_file" = "Tiedostoa %@ ei löydy!";
"alert.error_loading_script" = "Skriptiä %@ ei voida ladata!";
"alert.error_saving_file" = "Virhe tallennettaessa kohdetta %@: %@";
"alert.error_deleting_file" = "Tiedostoa ei voida poistaa.";

"alert.target_peak.bad_value" = "The value \"%@\" is invalid.\nPlease provide a value between 10 and 10000, or 0.";

"alert.config.new.title" = "Uudet syöttöasetukset";
"alert.config.new.message" = "Anna nimi uudelle konfiguraatiolle.";
"alert.config.duplicate.title" = "Monista asetukset";
"alert.config.duplicate.message" = "Anna nimi monistetulle asetustiedostolle.";
"alert.config.file_existing.title" = "Tiedosto on jo olemassa";
"alert.config.file_existing.message" = "A config file with the same filename already exists. Choose OK to show the file in Finder.";
"alert.config.cannot_create" = "Asetustiedostoa ei voitu luoda!\n%@";
"alert.config.cannot_write" = "Asetustiedostoon ei voida kirjoittaa!";
"alert.config.rename.title" = "Rename Input Configuration";
"alert.config.rename.message" = "Please enter the new name for the configuration.";

"alert.filter.incorrect" = "Suodattimia asetettaessa tapahtui virhe. Tarkista parametrisi muoto.";
"alert.add_filter.title" = "Uusi suodatin";
"alert.add_filter.message" = "Anna suodatinmerkkijono mpv:n vf tai af komennon muodossa.";

"alert.keybinding_config.error" = "Virhe luettaessa näppäimistöasetusten tiedostoa. \"%@\"! Palautetaan IINAn oletusnäppäimistöasetukset. Tarkista asetustiedostosi.";

"alert.extra_option.cannot_read" = "Ei voi lukea käyttäjän määrittämiä mpv-lisävalintoja.";
"alert.extra_option.empty" = "Avain tai arvo ei voi olla tyhjä!";
"alert.extra_option.error" = "Virhe asetettaessa valintaa --%@=%@ palautusarvolla %d. Tarkista lisävalintojen asetukset kohdasta Asetukset > Lisäasetukset.";
"alert.extra_option.config_folder" = "Virhe asetettaessa asetushakemistoa \"%@\".";

"alert.playlist.error_deleting" = "Virhe poistettaessa: %@";

"alert.screenshot.error_taking" = "Cannot take a screenshot!";

"alert.sub.no_selected" = "Valitse ensin ladatut tekstitykset.";
"alert.sub_lang_not_set" = "Aseta ensisijaiset tekstityskielet asetuksissa ennen OpenSubtitles-palvelun käyttöä. Englantia (eng) käytetään tällä kertaa.";
"alert.sub.cannot_save_passwd" = "Salasanaasi ei voi tallentaa Avainnippuun: %@";
"alert.sub.cannot_login" = "Kirjautuminen ei onnistu. Tarkista käyttäjänimesi, salasanasi ja verkon tila.\n\n%@";
"alert.sub.save_downloaded.title" = "Tallenna ladattu tekstitys";

"alert.set_default.title" = "IINA:n asettaminen oletussovellukseksi";
"alert.set_default.message" = "IINA asetetaan oletussovellukseksi kaikille tiedostotyypeille, joita se tukee.";
"alert.set_default.success" = "Valmis: %d onnistui ja %d epäonnistui.";

"alert.add_watch.title" = "Lisää seurattava ominaisuus";
"alert.add_watch.message" = "Anna kelvollinen mpv-ominaisuuden nimi.";

"alert.jump_to.title" = "Siirry kohtaan";
"alert.jump_to.message" = "Anna aika, johon haluat siirtyä. Esimerkki: 20:35";

"alert.opensub.login.title" = "OpenSubtitles-kirjautuminen";
"alert.opensub.login.message" = "Anna käyttäjänimesi ja salasanasi";

"alert.open_url.title" = "Avaa URL";
"alert.open_url.message" = "Anna URL-osoite:";
"alert.choose_media_file.title" = "Valitse mediatiedostoja";

"alert.add_url.title" = "Lisää URL-osoite";
"alert.add_url.message" = "Anna URL-osoite:";

"alert.delete_history.title" = "Poista toistohistoria";
"alert.delete_history.message" = "Haluatko varmasti poistaa valitut kohteet?";

"alert.filter_hwdec.message" = "Olet ottamassa käyttöön videosuodatinta. Nykyinen laitteistodekooderi ei kuitenkaan välttämättä tue videosuodattimia. Voit joko poistaa laitteiston dekoodauksen käytöstä tai vaihtaa Auto (kopioi) -tilaan, joka vie kaksi kertaa enemmän muistia.\nSaatat joutua toistamaan edellisen toimenpiteen (kuten asettaa rajauksen), jotta se toimisi.";
"alert.filter_hwdec.abort" = "Keskeytä";
"alert.filter_hwdec.turn_off" = "Poista laitteen dekoodaus käytöstä";
"alert.filter_hwdec.use_copy" = "Vaihda Auto (kopioi) -tilaan";

"alert.clear_cache.title" = "Poista esikatselukuvien välimuisti";
"alert.clear_cache.message" = "Oletko varma, että haluat poistaa esikatselukuvien välimuistit?";

"alert.clear_history.title" = "Tyhjennä toistohistoria";
"alert.clear_history.message" = "Poistetaanko varmasti kaikki toistohistoria?";

"alert.clear_watch_later.title" = "Tyhjennä tallennettu toiston edistyminen";
"alert.clear_watch_later.message" = "Haluatko varmasti poistaa kaikki talletetut toiston edistymistiedot (\"katso myöhemmin\" tiedot)?";

"alert.restore_alerts.title" = "Restore Suppressed Alerts";
"alert.restore_alerts.message" = "Are you sure you want to restore suppressed alerts?";

"alert.nothing_to_open" = "Ei mitään avattavaa.";

"alert.no_video_track" = "Videorataa ei ole.";

"alert.duplicate_config" = "Et voi muokata oletusasetusmäärittelyä suoraan. Kopioi asetusmäärittely ennen muokkausta.";

"alert.assrt_register" = "Rajoitetusta API-kiintiöstä johtuen, on erittäin suositeltavaa käyttää omaa API-avainta. Oletusavain on tarkoitettu vain demokäyttöön ja voi johtaa verkkovirheeseen.";
"alert.assrt_register.register" = "Rekisteröidy nyt";
"alert.assrt_register.try" = "Kokeile ensin";
"alert.assrt_token_prompt.title" = "Lisää API-avain";
"alert.assrt_token_prompt.message" = "Ole hyvä ja rekisteröidy avatulla verkkosivulla. Hae avaimesi käyttäjäsi kotisivulta ja syötä se alle:";
"alert.assrt_token_invalid" = "Assrt API -tunnisteesi näyttää olevan virheellinen.";

"alert.plugin_uninstall.title" = "Are you sure to uninstall %@?";
"alert.plugin_uninstall.message" = "The plugin will be deleted from your disk.";
"alert.plugin_reinstall.title" = "Plugin %@ already exists";
"alert.plugin_reinstall.message" = "Do you want to reinstall the plugin?";
"alert.duplicated_plugin_id" = "Duplicated plugin identifiers detected. Two or more plugins have the same identifier \"%@\". This may cause abnormal behaviors. Please find them in Preferences - Plugins and report to their authors. If a plugin is installed locally, you can also manually change its identifier in the plugin's Info.json file.";
"alert.plugin_no_update" = "No update found.";
"alert.plugin_update_found.title" = "Update found for %@";
"alert.plugin_update_found.message" = "The latest version is %@. You have %@. Would you like to update?";
"alert.plugin_permission" = "This plugin requires the following permissions. Please review them before proceeding.";
"alert.plugin_permission_added" = "This update requires additional permissions. Please review them before proceeding.";

"playlist.total_length" = "%@ yhteensä";
"playlist.total_length_with_selected" = "%@ / %@ valittu";
"playlist.sorting.header" = "Sorting";
"playlist.sorting.filename_ascending" = "Filename Ascending";
"playlist.sorting.filename_descending" = "Filename Descending";
"playlist.sorting.path_ascending" = "File Path Ascending";
"playlist.sorting.path_descending" = "File Path Descending";
"pl_menu.title_multi" = "%d kohdetta";
"pl_menu.play_next" = "Play Next";
"pl_menu.play_in_new_window" = "Toista uudessa ikkunassa";
"pl_menu.remove" = "Poista";
"pl_menu.remove_multi" = "Poista valitut";
"pl_menu.delete" = "Siirrä roskakoriin";
"pl_menu.delete_multi" = "Siirrä valitut tiedostot roskakoriin";
"pl_menu.delete_after_play" = "Siirrä roskakoriin toiston jälkeen";
"pl_menu.delete_after_play_multi" = "Siirrä valitut tiedostot roskakoriin toiston jälkeen";
"pl_menu.show_in_finder" = "Näytä Finderissa";
"pl_menu.add_file" = "Lisää tiedosto…";
"pl_menu.add_url" = "Lisää URL-osoite…";
"pl_menu.clear_playlist" = "Tyhjennä soittolista";
"pl_menu.matched_sub" = "Matched %d Subtitle(s)";
"pl_menu.add_sub" = "Lisää tekstitys…";
"pl_menu.wrong_sub" = "Väärä tekstitys!";
"pl_menu.browser" = "Avaa selaimessa";
"pl_menu.copy_url" = "Kopioi URL-osoite";
"pl_menu.copy_url_multi" = "Kopioi URL-osoitteet";

"keymapping.title" = "Näppäinmääritykset";
"keymapping.message" = "Tallenna painamalla mitä tahansa näppäintä.";

"filter.video_filters" = "Videosuodattimet";
"filter.audio_filters" = "Äänisuodattimet";

"hwdec.no" = "Poista laitteistopurku käytöstä.";
"hwdec.auto" = "Ota käyttöön laitteistopurku. Useimmat videosuodattimet eivät kuitenkaan toimi kunnolla.";
"hwdec.auto-copy" = "Ota käyttöön laitteistopurku. Kuluttaa muistia kaksinkertaisesti, mutta toimii videosuodattimien kanssa.";

"gaplessAudio.no" = "Playback of consecutive audio files may result in silence or disruption at the point of file change.";
"gaplessAudio.weak" = "If the audio format the decoder output changes, the audio device is closed and reopened, disrupting gapless playback.";
"gaplessAudio.yes" = "The audio device is opened using parameters chosen for the first file played and is then kept open for gapless playback. Following files may be resampled.";

"subencoding.auto" = "Automaattinen tunnistus";

"osc_toolbar.settings" = "Pika-asetukset";
"osc_toolbar.playlist" = "Soittolista ja luvut";
"osc_toolbar.pip" = "Vaihda kuva kuvassa -tilaa";
"osc_toolbar.full_screen" = "Vaihda koko näytön tilaan";
"osc_toolbar.music_mode" = "Siirry musiikkitilaan";
"osc_toolbar.sub_track" = "Valitse tekstitysraita";
"osc_toolbar.screenshot" = "Take a screenshot";
"osc_toolbar.plugins" = "Show plugins panel";

"mini_player.album_art" = "Näytä albumin kansikuva";
"mini_player.loop" = "Toista";
"mini_player.shuffle" = "Sekoitus";
"mini_player.remove" = "Poista soittolistalta";
"mini_player.add" = "Lisää soittolistaan";
"mini_player.delete" = "Poista kaikki kappaleet soittolistalta";
"mini_player.volume" = "Äänenvoimakkuus";
"mini_player.close" = "Sulje musiikkitila";
"mini_player.back" = "Palaa videotilaan";
"mini_player.sort" = "Sort the playlist";

// Touch bar

"touchbar.ahead_15" = "15sek eteen";
"touchbar.ahead_30" = "30sek eteen";
"touchbar.back_15" = "15sek taakse";
"touchbar.back_30" = "30sek taakse";
"touchbar.next_video" = "Seuraava video";
"touchbar.prev_video" = "Edellinen video";
"touchbar.increase_volume" = "Äänenvoimakkuus +";
"touchbar.decrease_volume" = "Äänenvoimakkuus -";
"touchbar.rewind" = "Kelaa taaksepäin";
"touchbar.fast_forward" = "Kelaa eteenpäin";
"touchbar.play_pause" = "Toista / Tauko";
"touchbar.seek" = "Siirry";
"touchbar.time" = "Ajan sijainti";
"touchbar.remainingTimeOrTotalDuration" = "Jäljellä oleva aika / kokonaiskesto";
"touchbar.toggle_pip" = "Vaihda kuva kuvassa -tilaan";

// Plugin permissions

"permissions.network-request.name" = "Network Request";
"permissions.network-request.desc" = "This plugin can make requsts from or upload data to these websites:";
"permissions.network-request.any_site" = "Any site";
"permissions.show-osd.name" = "Show OSD";
"permissions.show-osd.desc" = "This plugin can show OSD (On Screen Display) messages.";
"permissions.show-alert.name" = "Show Alerts";
"permissions.show-alert.desc" = "This plugin can show pop-up alerts.";
"permissions.video-overlay.name" = "Add overlays on videos";
"permissions.video-overlay.desc" = "This plugin can render additional content on the top of the video.";
"permissions.file-system.name" = "Access the file system";
"permissions.file-system.desc" = "This plugin can read or write files on your disk, which may include sensitive information. It can also execute other programs or applications that can harm your computer. So be sure to verify the source.";

"plugin.install" = "Install";
"plugin.installed" = "Installed";
"plugin.not_installed" = "Not Installed";
"plugin.local" = "Installed locally";
"alert.plugin.install_error" = "Error occurred during the installation: %@";
"alert.invalid_url" = "The URL is invalid.";
"plugin.install_error.invalid_url" = "The URL is invalid.";
"plugin.install_error.file_not_found" = "Cannot find the package file.";
"plugin.install_error.cannot_download" = "Failed to download the plugin.\n\nOutput:%@\n";
"plugin.install_error.cannot_unpackage" = "Failed to unpackage the plugin.\n\nOutput:%@\n";
"plugin.install_error.cannot_load" = "IINA cannot load this plugin. It might be in the wrong format.";
"plugin.check_for_updates" = "Tarkista päivitykset";
"plugin.updating" = "Downloading update…";
